app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Hi"], ["text", "My name is Dat"], ["created_at", 2017-03-12 18:10:07 UTC], ["updated_at", 2017-03-12 18:10:07 UTC]]
---
  def create
    @article = Article.new(article_params)

    @article.save